In [1]:
# Load library pandas
import pandas as pd 

# Load dataset
data = pd.read_fwf("adult.data", names=['col1', 'col2'])
dataf = data.col2.str.split(",",expand=True)

# assign nama kolom
dataf.columns = ['workclass', 'fnlwgt',
                 'education',
                 'education-num',
                 'marital-status',
                 'occupation',
                 'relationship',
                 'race',
                 'sex',
                 'capital-gain',
                 'capital-loss',
                 'hours-per-week',
                 'native-country',
                 'yearly income']
dataf['age'] = data.col1.str.replace(',','')
dataf.head(5)

,workclass,fnlwgt,education,education-num,marital-status,occupation,relationship,race,sex,capital-gain,capital-loss,hours-per-week,native-country,yearly income,age
0,State-gov,77516,Bachelors,13,Never-married,Adm-clerical,Not-in-family,White,Male,2174,0,40,United-States,<=50K,39
1,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K,50
2,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K,38
3,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,<=50K,53
4,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,<=50K,28

In [2]:
# Mencari data yang kosong
dataf.isna().any()

workclass         True
fnlwgt            True
education         True
education-num     True
marital-status    True
occupation        True
relationship      True
race              True
sex               True
capital-gain      True
capital-loss      True
hours-per-week    True
native-country    True
yearly income     True
age               True
dtype: bool

In [3]:
# Cari missing values (NaN)
nanCol = dataf.columns[dataf.isna().any()]
dataf[nanCol].isna().sum()

workclass           1
fnlwgt              1
education           1
education-num       1
marital-status      1
occupation          1
relationship        1
race                1
sex                 1
capital-gain        1
capital-loss        1
hours-per-week      1
native-country      2
yearly income     122
age                 1
dtype: int64

In [4]:
# Ringkasan Statistik
dataf.describe()

,workclass,fnlwgt,education,education-num,marital-status,occupation,relationship,race,sex,capital-gain,capital-loss,hours-per-week,native-country,yearly income,age
count,32561,32561,32561,32561,32561,32561,32561,32561,32561,32561,32561,32561,32560,32440,32561
unique,9,21648,16,16,7,15,6,5,2,119,92,94,66,10,73
top,Private,123011,HS-grad,9,Married-civ-spouse,Prof-specialty,Husband,White,Male,0,0,40,United-States,<=50K,36
freq,22696,13,10501,10501,14976,4140,13193,27816,21790,29849,31042,15217,29109,24179,898

In [6]:
# Distribusi data
dataf.groupby('marital-status').size()

marital-status
 Divorced                  4443
 Married-AF-spouse           23
 Married-civ-spouse       14976
 Married-spouse-absent      418
 Never-married            10683
 Separated                 1025
 Widowed                    993
dtype: int64